In [1]:
import mysql.connector as c
mydb=c.connect(host='localhost',user='root',passwd='*22MGBEENa*')
cursor=mydb.cursor()

In [10]:
cursor.execute('create database today')

In [11]:
cursor.execute('create table today.today1(FIRST_NAME VARCHAR(30),DEPARTMENT VARCHAR(30))')

In [13]:
cursor.execute('insert into today.today1 values("sam","tech")')

In [14]:
cursor.execute('insert into today.today1 values("sam1","teaching")')
cursor.execute('insert into today.today1 values("sam2","sports")')
cursor.execute('insert into today.today1 values("sam3","tech")')
cursor.execute('insert into today.today1 values("sam4","tech")')
cursor.execute('insert into today.today1 values("sam5","sports")')
cursor.execute('insert into today.today1 values("sam6","teaching")')
cursor.execute('insert into today.today1 values("sam7","owner")')
cursor.execute('insert into today.today1 values("sam8","author")')
cursor.execute('insert into today.today1 values("sam9","student")')
cursor.execute('insert into today.today1 values("sam10","sales")')

In [15]:
mydb.commit()

In [17]:
cursor.execute('select * from today.today1')

In [18]:
cursor.fetchall()

[('sam', 'tech'),
 ('sam1', 'teaching'),
 ('sam2', 'sports'),
 ('sam3', 'tech'),
 ('sam4', 'tech'),
 ('sam5', 'sports'),
 ('sam6', 'teaching'),
 ('sam7', 'owner'),
 ('sam8', 'author'),
 ('sam9', 'student'),
 ('sam10', 'sales')]

Q-1. Write an SQL query to fetch “FIRST_NAME” from Worker table using the alias name as WORKER_NAME.

In [21]:
cursor.execute('select FIRST_NAME as WORKER_NAME from today.today1 ')

In [22]:
cursor.fetchall()

[('sam',),
 ('sam1',),
 ('sam2',),
 ('sam3',),
 ('sam4',),
 ('sam5',),
 ('sam6',),
 ('sam7',),
 ('sam8',),
 ('sam9',),
 ('sam10',)]

Q-2. Write an SQL query to fetch unique values of DEPARTMENT from Worker table.

In [27]:
cursor.execute('select DEPARTMENT from today.today1 group by DEPARTMENT')

In [28]:
cursor.fetchall()

[('author',),
 ('owner',),
 ('sales',),
 ('sports',),
 ('student',),
 ('teaching',),
 ('tech',)]

Q-3. Write an SQL query to show the last 5 record from a table.

In [36]:
cursor.execute('select * from today.today1 order by FIRST_NAME desc limit 5')

In [37]:
cursor.fetchall()

[('sam9', 'student'),
 ('sam8', 'author'),
 ('sam7', 'owner'),
 ('sam6', 'teaching'),
 ('sam5', 'sports')]